Autodesk.Revit.DB.Events.FileImportedEventArgs.ImportedInstanceId
The ElementId of the imported instance that represents the imported object(s) after a successful import.
It could be used for further manipulation of that instance.
Remarks:
The value could be InvalidElementId for some type of import formats, such as GBXML and Inventor files.
Since:
2010

Autodesk.Revit.DB.Events.FileImportedEventArgs.Format
Identifies the import format, e.g. DWG or image.
Since:
2010

Autodesk.Revit.DB.Events.FileImportedEventArgs.Path
Path of the source file that was imported.
Since:
2010

Autodesk.Revit.DB.Events.FileImportedEventArgs
The event arguments used by the FileImported event.
Since:
2010